data/Section 5/5.2/Client/VM1_Instance1/rep1/output_C2_T1_W64_K6_R1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       46180 ops,     597 (avg:     513) ops/sec, 2.12MB/sec (avg: 1.82MB/sec),  3.34 (avg:  3.88) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         256.57          ---          ---      3.87600       266.44
Gets         256.54      1539.26         0.00      3.88900      1601.57
Waits          0.00          ---          ---      0.00000          ---
Totals       513.11      1539.26         0.00      3.88300      1868.01


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.300         0.00
SET       1.400         0.11
SET       1.500         0.67
SET       1.600         2.32
SET       1.700         5.43
SET       1.800         9.66
SET       1.900        14.80
SET       2.000        20.22
SET       2.100        25.04
SET       2.200        29.97
SET       2.300        34.17
SET       2.400        37.82
SET       2.500        41.41
SET       2.600        44.15
SET       2.700        46.57
SET       2.800        48.75
SET       2.900        50.44
SET       3.000        52.09
SET       3.100        53.42
SET       3.200        54.54
SET       3.300        55.61
SET       3.400        56.62
SET       3.500        57.52
SET       3.600        58.41
SET       3.700        59.29
SET       3.800        60.23
SET       3.900        61.14
SET       4.000        62.22
SET       4.100        63.15
SET       4.200        64.10
SET       4.300        65.26
SET       4.400        66.45
SET       4.500        67.54
SET       4.600        68.77
SET       4.700        70.04
SET       4.800        71.29
SET       4.900        72.51
SET       5.000        73.72
SET       5.100        75.09
SET       5.200        76.64
SET       5.300        78.11
SET       5.400        79.40
SET       5.500        80.85
SET       5.600        82.24
SET       5.700        83.61
SET       5.800        84.73
SET       5.900        85.83
SET       6.000        86.88
SET       6.100        87.67
SET       6.200        88.50
SET       6.300        89.36
SET       6.400        90.11
SET       6.500        90.82
SET       6.600        91.24
SET       6.700        91.69
SET       6.800        92.09
SET       6.900        92.50
SET       7.000        92.81
SET       7.100        93.08
SET       7.200        93.40
SET       7.300        93.67
SET       7.400        93.93
SET       7.500        94.16
SET       7.600        94.41
SET       7.700        94.63
SET       7.800        94.83
SET       7.900        95.02
SET       8.000        95.20
SET       8.100        95.45
SET       8.200        95.66
SET       8.300        95.79
SET       8.400        95.97
SET       8.500        96.11
SET       8.600        96.23
SET       8.700        96.35
SET       8.800        96.48
SET       8.900        96.60
SET       9.000        96.71
SET       9.100        96.83
SET       9.200        96.94
SET       9.300        97.04
SET       9.400        97.12
SET       9.500        97.21
SET       9.600        97.33
SET       9.700        97.43
SET       9.800        97.56
SET       9.900        97.68
SET      10.000        98.14
SET      11.000        98.56
SET      12.000        98.89
SET      13.000        99.09
SET      14.000        99.25
SET      15.000        99.40
SET      16.000        99.51
SET      17.000        99.63
SET      18.000        99.70
SET      19.000        99.78
SET      20.000        99.81
SET      21.000        99.86
SET      22.000        99.90
SET      23.000        99.93
SET      24.000        99.96
SET      25.000        99.97
SET      26.000        99.97
SET      27.000        99.98
SET      28.000        99.99
SET      46.000        99.99
SET      49.000       100.00
SET     300.000       100.00
---
GET       1.500         0.01
GET       1.600         0.16
GET       1.700         0.74
GET       1.800         2.65
GET       1.900         6.10
GET       2.000        10.77
GET       2.100        16.41
GET       2.200        22.18
GET       2.300        28.27
GET       2.400        33.41
GET       2.500        38.04
GET       2.600        41.92
GET       2.700        45.00
GET       2.800        47.88
GET       2.900        50.25
GET       3.000        52.55
GET       3.100        54.29
GET       3.200        55.94
GET       3.300        57.36
GET       3.400        58.55
GET       3.500        59.56
GET       3.600        60.49
GET       3.700        61.53
GET       3.800        62.26
GET       3.900        62.99
GET       4.000        63.75
GET       4.100        64.59
GET       4.200        65.36
GET       4.300        66.20
GET       4.400        67.08
GET       4.500        67.93
GET       4.600        68.77
GET       4.700        69.80
GET       4.800        70.75
GET       4.900        71.94
GET       5.000        73.10
GET       5.100        74.21
GET       5.200        75.40
GET       5.300        76.76
GET       5.400        78.08
GET       5.500        79.32
GET       5.600        80.63
GET       5.700        82.03
GET       5.800        83.41
GET       5.900        84.77
GET       6.000        86.01
GET       6.100        87.22
GET       6.200        88.42
GET       6.300        89.29
GET       6.400        90.26
GET       6.500        91.01
GET       6.600        91.75
GET       6.700        92.40
GET       6.800        92.96
GET       6.900        93.37
GET       7.000        93.80
GET       7.100        94.09
GET       7.200        94.49
GET       7.300        94.84
GET       7.400        95.11
GET       7.500        95.31
GET       7.600        95.53
GET       7.700        95.76
GET       7.800        95.89
GET       7.900        96.06
GET       8.000        96.20
GET       8.100        96.36
GET       8.200        96.51
GET       8.300        96.62
GET       8.400        96.75
GET       8.500        96.87
GET       8.600        96.96
GET       8.700        97.11
GET       8.800        97.20
GET       8.900        97.25
GET       9.000        97.35
GET       9.100        97.45
GET       9.200        97.58
GET       9.300        97.68
GET       9.400        97.80
GET       9.500        97.91
GET       9.600        98.02
GET       9.700        98.09
GET       9.800        98.19
GET       9.900        98.26
GET      10.000        98.61
GET      11.000        99.04
GET      12.000        99.25
GET      13.000        99.43
GET      14.000        99.51
GET      15.000        99.60
GET      16.000        99.65
GET      17.000        99.72
GET      18.000        99.77
GET      19.000        99.79
GET      20.000        99.85
GET      21.000        99.87
GET      22.000        99.87
GET      23.000        99.88
GET      24.000        99.90
GET      25.000        99.92
GET      26.000        99.94
GET      27.000        99.94
GET      28.000        99.94
GET      29.000        99.97
GET      30.000        99.97
GET      33.000        99.98
GET      34.000        99.98
GET      49.000        99.99
GET      83.000       100.00
GET     300.000       100.00
---